// Реализуйте функцию, которая будет принимать 2 параметра: строку в виде
// бинарного числа и число. Создайте функцию, которая будет, во-первых, проверять
// подходит ли бинарное число под шаблон регулярного выражения (состоит только
// из 1 и 0), и, во-вторых, определять, является ли число после перевода из двоичной
// системы в десятичную равно 2 параметру передаваемому в функцию.
// Написать свой алгоритм. Не использовать методы преобразования числа из 1
// системы в 2 (например, parseInt). 

